garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f24q71.h
// Register: OPA2CON0
#define OPA2CON0 OPA2CON0
extern volatile unsigned char           OPA2CON0            __at(0x127);
#ifndef _LIB_BUILD
asm("OPA2CON0 equ 0127h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned UG                     :1;
        unsigned                        :1;
        unsigned CPON                   :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :3;
        unsigned UG0                    :1;
    };
    struct {
        unsigned                        :3;
        unsigned OPA2UG                 :1;
        unsigned                        :1;
        unsigned OPA2CPON               :1;
        unsigned                        :1;
        unsigned OPA2EN                 :1;
    };
} OPA2CON0bits_t;
extern volatile OPA2CON0bits_t OPA2CON0bits __at(0x127);
// bitfield macros
#define _OPA2CON0_UG_POSN                                   0x3
#define _OPA2CON0_UG_POSITION                               0x3
#define _OPA2CON0_UG_SIZE                                   0x1
#define _OPA2CON0_UG_LENGTH                                 0x1
#define _OPA2CON0_UG_MASK                                   0x8
#define _OPA2CON0_CPON_POSN                                 0x5
#define _OPA2CON0_CPON_POSITION                             0x5
#define _OPA2CON0_CPON_SIZE                                 0x1
#define _OPA2CON0_CPON_LENGTH                               0x1
#define _OPA2CON0_CPON_MASK                                 0x20
#define _OPA2CON0_EN_POSN                                   0x7
#define _OPA2CON0_EN_POSITION                               0x7
#define _OPA2CON0_EN_SIZE                                   0x1
#define _OPA2CON0_EN_LENGTH                                 0x1
#define _OPA2CON0_EN_MASK                                   0x80
#define _OPA2CON0_UG0_POSN                                  0x3
#define _OPA2CON0_UG0_POSITION                              0x3
#define _OPA2CON0_UG0_SIZE                                  0x1
#define _OPA2CON0_UG0_LENGTH                                0x1
#define _OPA2CON0_UG0_MASK                                  0x8
#define _OPA2CON0_OPA2UG_POSN                               0x3
#define _OPA2CON0_OPA2UG_POSITION                           0x3
#define _OPA2CON0_OPA2UG_SIZE                               0x1
#define _OPA2CON0_OPA2UG_LENGTH                             0x1
#define _OPA2CON0_OPA2UG_MASK                               0x8
#define _OPA2CON0_OPA2CPON_POSN                             0x5
#define _OPA2CON0_OPA2CPON_POSITION                         0x5
#define _OPA2CON0_OPA2CPON_SIZE                             0x1
#define _OPA2CON0_OPA2CPON_LENGTH                           0x1
#define _OPA2CON0_OPA2CPON_MASK                             0x20
#define _OPA2CON0_OPA2EN_POSN                               0x7
#define _OPA2CON0_OPA2EN_POSITION                           0x7
#define _OPA2CON0_OPA2EN_SIZE                               0x1
#define _OPA2CON0_OPA2EN_LENGTH                             0x1
#define _OPA2CON0_OPA2EN_MASK                               0x80

// Register: OPA2CON1
#define OPA2CON1 OPA2CON1
extern volatile unsigned char           OPA2CON1            __at(0x128);
#ifndef _LIB_BUILD
asm("OPA2CON1 equ 0128h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :3;
        unsigned RESON                  :1;
        unsigned GSEL                   :3;
    };
    struct {
        unsigned NSS0                   :1;
        unsigned NSS1                   :1;
        unsigned NSS2                   :1;
        unsigned                        :1;
        unsigned GSEL0                  :1;
        unsigned GSEL1                  :1;
        unsigned GSEL2                  :1;
    };
    struct {
        unsigned OPA2NSS                :3;
        unsigned OPA2RESON              :1;
        unsigned OPA2GSEL               :3;
    };
    struct {
        unsigned OPA2NSS0               :1;
        unsigned OPA2NSS1               :1;
        unsigned OPA2NSS2               :1;
        unsigned                        :1;
        unsigned OPA2GSEL0              :1;
        unsigned OPA2GSEL1              :1;
        unsigned OPA2GSEL2              :1;
    };
} OPA2CON1bits_t;
extern volatile OPA2CON1bits_t OPA2CON1bits __at(0x128);
// bitfield macros
#define _OPA2CON1_NSS_POSN                                  0x0
#define _OPA2CON1_NSS_POSITION                              0x0
#define _OPA2CON1_NSS_SIZE                                  0x3
#define _OPA2CON1_NSS_LENGTH                                0x3
#define _OPA2CON1_NSS_MASK                                  0x7
#define _OPA2CON1_RESON_POSN                                0x3
#define _OPA2CON1_RESON_POSITION                            0x3
#define _OPA2CON1_RESON_SIZE                                0x1
#define _OPA2CON1_RESON_LENGTH                              0x1
#define _OPA2CON1_RESON_MASK                                0x8
#define _OPA2CON1_GSEL_POSN                                 0x4
#define _OPA2CON1_GSEL_POSITION                             0x4
#define _OPA2CON1_GSEL_SIZE                                 0x3
#define _OPA2CON1_GSEL_LENGTH                               0x3
#define _OPA2CON1_GSEL_MASK                                 0x70
#define _OPA2CON1_NSS0_POSN                                 0x0
#define _OPA2CON1_NSS0_POSITION                             0x0
#define _OPA2CON1_NSS0_SIZE                                 0x1
#define _OPA2CON1_NSS0_LENGTH                               0x1
#define _OPA2CON1_NSS0_MASK                                 0x1
#define _OPA2CON1_NSS1_POSN                                 0x1
#define _OPA2CON1_NSS1_POSITION                             0x1
#define _OPA2CON1_NSS1_SIZE                                 0x1
#define _OPA2CON1_NSS1_LENGTH                               0x1
#define _OPA2CON1_NSS1_MASK                                 0x2
#define _OPA2CON1_NSS2_POSN                                 0x2
#define _OPA2CON1_NSS2_POSITION                             0x2
#define _OPA2CON1_NSS2_SIZE                                 0x1
#define _OPA2CON1_NSS2_LENGTH                               0x1
#define _OPA2CON1_NSS2_MASK                                 0x4
#define _OPA2CON1_GSEL0_POSN                                0x4
#define _OPA2CON1_GSEL0_POSITION                            0x4
#define _OPA2CON1_GSEL0_SIZE                                0x1
#define _OPA2CON1_GSEL0_LENGTH                              0x1
#define _OPA2CON1_GSEL0_MASK                                0x10
#define _OPA2CON1_GSEL1_POSN                                0x5
#define _OPA2CON1_GSEL1_POSITION                            0x5
#define _OPA2CON1_GSEL1_SIZE                                0x1
#define _OPA2CON1_GSEL1_LENGTH                              0x1
#define _OPA2CON1_GSEL1_MASK                                0x20
#define _OPA2CON1_GSEL2_POSN                                0x6
#define _OPA2CON1_GSEL2_POSITION                            0x6
#define _OPA2CON1_GSEL2_SIZE                                0x1
#define _OPA2CON1_GSEL2_LENGTH                              0x1
#define _OPA2CON1_GSEL2_MASK                                0x40
#define _OPA2CON1_OPA2NSS_POSN                              0x0
#define _OPA2CON1_OPA2NSS_POSITION                          0x0
#define _OPA2CON1_OPA2NSS_SIZE                              0x3
#define _OPA2CON1_OPA2NSS_LENGTH                            0x3
#define _OPA2CON1_OPA2NSS_MASK                              0x7
#define _OPA2CON1_OPA2RESON_POSN                            0x3
#define _OPA2CON1_OPA2RESON_POSITION                        0x3
#define _OPA2CON1_OPA2RESON_SIZE                            0x1
#define _OPA2CON1_OPA2RESON_LENGTH                          0x1
#define _OPA2CON1_OPA2RESON_MASK                            0x8
#define _OPA2CON1_OPA2GSEL_POSN                             0x4
#define _OPA2CON1_OPA2GSEL_POSITION                         0x4
#define _OPA2CON1_OPA2GSEL_SIZE                             0x3
#define _OPA2CON1_OPA2GSEL_LENGTH                           0x3
#define _OPA2CON1_OPA2GSEL_MASK                             0x70
#define _OPA2CON1_OPA2NSS0_POSN                             0x0
#define _OPA2CON1_OPA2NSS0_POSITION                         0x0
#define _OPA2CON1_OPA2NSS0_SIZE                             0x1
#define _OPA2CON1_OPA2NSS0_LENGTH                           0x1
#define _OPA2CON1_OPA2NSS0_MASK                             0x1
#define _OPA2CON1_OPA2NSS1_POSN                             0x1
#define _OPA2CON1_OPA2NSS1_POSITION                         0x1
#define _OPA2CON1_OPA2NSS1_SIZE                             0x1
#define _OPA2CON1_OPA2NSS1_LENGTH                           0x1
#define _OPA2CON1_OPA2NSS1_MASK                             0x2
#define _OPA2CON1_OPA2NSS2_POSN                             0x2
#define _OPA2CON1_OPA2NSS2_POSITION                         0x2
#define _OPA2CON1_OPA2NSS2_SIZE                             0x1
#define _OPA2CON1_OPA2NSS2_LENGTH                           0x1
#define _OPA2CON1_OPA2NSS2_MASK                             0x4
#define _OPA2CON1_OPA2GSEL0_POSN                            0x4
#define _OPA2CON1_OPA2GSEL0_POSITION                        0x4
#define _OPA2CON1_OPA2GSEL0_SIZE                            0x1
#define _OPA2CON1_OPA2GSEL0_LENGTH                          0x1
#define _OPA2CON1_OPA2GSEL0_MASK                            0x10
#define _OPA2CON1_OPA2GSEL1_POSN                            0x5
#define _OPA2CON1_OPA2GSEL1_POSITION                        0x5
#define _OPA2CON1_OPA2GSEL1_SIZE                            0x1
#define _OPA2CON1_OPA2GSEL1_LENGTH                          0x1
#define _OPA2CON1_OPA2GSEL1_MASK                            0x20
#define _OPA2CON1_OPA2GSEL2_POSN                            0x6
#define _OPA2CON1_OPA2GSEL2_POSITION                        0x6
#define _OPA2CON1_OPA2GSEL2_SIZE                            0x1
#define _OPA2CON1_OPA2GSEL2_LENGTH                          0x1
#define _OPA2CON1_OPA2GSEL2_MASK                            0x40

