garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f24q71.h
// Register: APMEND1L
#define APMEND1L APMEND1L
extern volatile unsigned char           APMEND1L            __at(0x1CE);
#ifndef _LIB_BUILD
asm("APMEND1L equ 01CEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned END1                   :8;
    };
} APMEND1Lbits_t;
extern volatile APMEND1Lbits_t APMEND1Lbits __at(0x1CE);
// bitfield macros
#define _APMEND1L_END1_POSN                                 0x0
#define _APMEND1L_END1_POSITION                             0x0
#define _APMEND1L_END1_SIZE                                 0x8
#define _APMEND1L_END1_LENGTH                               0x8
#define _APMEND1L_END1_MASK                                 0xFF

// Register: APMEND1H
#define APMEND1H APMEND1H
extern volatile unsigned char           APMEND1H            __at(0x1CF);
#ifndef _LIB_BUILD
asm("APMEND1H equ 01CFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned END1                   :8;
    };
} APMEND1Hbits_t;
extern volatile APMEND1Hbits_t APMEND1Hbits __at(0x1CF);
// bitfield macros
#define _APMEND1H_END1_POSN                                 0x0
#define _APMEND1H_END1_POSITION                             0x0
#define _APMEND1H_END1_SIZE                                 0x8
#define _APMEND1H_END1_LENGTH                               0x8
#define _APMEND1H_END1_MASK                                 0xFF

// Register: APMEND1U
#define APMEND1U APMEND1U
extern volatile unsigned char           APMEND1U            __at(0x1D0);
#ifndef _LIB_BUILD
asm("APMEND1U equ 01D0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned END1                   :8;
    };
} APMEND1Ubits_t;
extern volatile APMEND1Ubits_t APMEND1Ubits __at(0x1D0);
// bitfield macros
#define _APMEND1U_END1_POSN                                 0x0
#define _APMEND1U_END1_POSITION                             0x0
#define _APMEND1U_END1_SIZE                                 0x8
#define _APMEND1U_END1_LENGTH                               0x8
#define _APMEND1U_END1_MASK                                 0xFF

// Register: APMPERE1
#define APMPERE1 APMPERE1
extern volatile unsigned short          APMPERE1            __at(0x1D1);
#ifndef _LIB_BUILD
asm("APMPERE1 equ 01D1h");
#endif

// Register: APMPERE1L
#define APMPERE1L APMPERE1L
extern volatile unsigned char           APMPERE1L           __at(0x1D1);
#ifndef _LIB_BUILD
asm("APMPERE1L equ 01D1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned APMPERE1               :8;
    };
    struct {
        unsigned                        :2;
        unsigned BG                     :1;
        unsigned FVR1                   :1;
        unsigned FVR2                   :1;
        unsigned ADCD                   :1;
        unsigned ADCA                   :1;
        unsigned TEMP                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned APMPERE1_2             :1;
        unsigned APMPERE1_3             :1;
        unsigned APMPERE1_4             :1;
        unsigned APMPERE1_5             :1;
        unsigned APMPERE1_6             :1;
        unsigned APMPERE1_7             :1;
    };
} APMPERE1Lbits_t;
extern volatile APMPERE1Lbits_t APMPERE1Lbits __at(0x1D1);
// bitfield macros
#define _APMPERE1L_APMPERE1_POSN                            0x0
#define _APMPERE1L_APMPERE1_POSITION                        0x0
#define _APMPERE1L_APMPERE1_SIZE                            0x8
#define _APMPERE1L_APMPERE1_LENGTH                          0x8
#define _APMPERE1L_APMPERE1_MASK                            0xFF
#define _APMPERE1L_BG_POSN                                  0x2
#define _APMPERE1L_BG_POSITION                              0x2
#define _APMPERE1L_BG_SIZE                                  0x1
#define _APMPERE1L_BG_LENGTH                                0x1
#define _APMPERE1L_BG_MASK                                  0x4
#define _APMPERE1L_FVR1_POSN                                0x3
#define _APMPERE1L_FVR1_POSITION                            0x3
#define _APMPERE1L_FVR1_SIZE                                0x1
#define _APMPERE1L_FVR1_LENGTH                              0x1
#define _APMPERE1L_FVR1_MASK                                0x8
#define _APMPERE1L_FVR2_POSN                                0x4
#define _APMPERE1L_FVR2_POSITION                            0x4
#define _APMPERE1L_FVR2_SIZE                                0x1
#define _APMPERE1L_FVR2_LENGTH                              0x1
#define _APMPERE1L_FVR2_MASK                                0x10
#define _APMPERE1L_ADCD_POSN                                0x5
#define _APMPERE1L_ADCD_POSITION                            0x5
#define _APMPERE1L_ADCD_SIZE                                0x1
#define _APMPERE1L_ADCD_LENGTH                              0x1
#define _APMPERE1L_ADCD_MASK                                0x20
#define _APMPERE1L_ADCA_POSN                                0x6
#define _APMPERE1L_ADCA_POSITION                            0x6
#define _APMPERE1L_ADCA_SIZE                                0x1
#define _APMPERE1L_ADCA_LENGTH                              0x1
#define _APMPERE1L_ADCA_MASK                                0x40
#define _APMPERE1L_TEMP_POSN                                0x7
#define _APMPERE1L_TEMP_POSITION                            0x7
#define _APMPERE1L_TEMP_SIZE                                0x1
#define _APMPERE1L_TEMP_LENGTH                              0x1
#define _APMPERE1L_TEMP_MASK                                0x80
#define _APMPERE1L_APMPERE1_2_POSN                          0x2
#define _APMPERE1L_APMPERE1_2_POSITION                      0x2
#define _APMPERE1L_APMPERE1_2_SIZE                          0x1
#define _APMPERE1L_APMPERE1_2_LENGTH                        0x1
#define _APMPERE1L_APMPERE1_2_MASK                          0x4
#define _APMPERE1L_APMPERE1_3_POSN                          0x3
#define _APMPERE1L_APMPERE1_3_POSITION                      0x3
#define _APMPERE1L_APMPERE1_3_SIZE                          0x1
#define _APMPERE1L_APMPERE1_3_LENGTH                        0x1
#define _APMPERE1L_APMPERE1_3_MASK                          0x8
#define _APMPERE1L_APMPERE1_4_POSN                          0x4
#define _APMPERE1L_APMPERE1_4_POSITION                      0x4
#define _APMPERE1L_APMPERE1_4_SIZE                          0x1
#define _APMPERE1L_APMPERE1_4_LENGTH                        0x1
#define _APMPERE1L_APMPERE1_4_MASK                          0x10
#define _APMPERE1L_APMPERE1_5_POSN                          0x5
#define _APMPERE1L_APMPERE1_5_POSITION                      0x5
#define _APMPERE1L_APMPERE1_5_SIZE                          0x1
#define _APMPERE1L_APMPERE1_5_LENGTH                        0x1
#define _APMPERE1L_APMPERE1_5_MASK                          0x20
#define _APMPERE1L_APMPERE1_6_POSN                          0x6
#define _APMPERE1L_APMPERE1_6_POSITION                      0x6
#define _APMPERE1L_APMPERE1_6_SIZE                          0x1
#define _APMPERE1L_APMPERE1_6_LENGTH                        0x1
#define _APMPERE1L_APMPERE1_6_MASK                          0x40
#define _APMPERE1L_APMPERE1_7_POSN                          0x7
#define _APMPERE1L_APMPERE1_7_POSITION                      0x7
#define _APMPERE1L_APMPERE1_7_SIZE                          0x1
#define _APMPERE1L_APMPERE1_7_LENGTH                        0x1
#define _APMPERE1L_APMPERE1_7_MASK                          0x80

