garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f24q71.h
// Register: APMCLKPPS
#define APMCLKPPS APMCLKPPS
extern volatile unsigned char           APMCLKPPS           __at(0x27A);
#ifndef _LIB_BUILD
asm("APMCLKPPS equ 027Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned APMCLKPPS0             :1;
        unsigned APMCLKPPS1             :1;
        unsigned APMCLKPPS2             :1;
        unsigned APMCLKPPS3             :1;
        unsigned APMCLKPPS4             :1;
        unsigned APMCLKPPS5             :1;
    };
    struct {
        unsigned APMCLKPPS              :6;
    };
} APMCLKPPSbits_t;
extern volatile APMCLKPPSbits_t APMCLKPPSbits __at(0x27A);
// bitfield macros
#define _APMCLKPPS_PIN_POSN                                 0x0
#define _APMCLKPPS_PIN_POSITION                             0x0
#define _APMCLKPPS_PIN_SIZE                                 0x3
#define _APMCLKPPS_PIN_LENGTH                               0x3
#define _APMCLKPPS_PIN_MASK                                 0x7
#define _APMCLKPPS_PORT_POSN                                0x3
#define _APMCLKPPS_PORT_POSITION                            0x3
#define _APMCLKPPS_PORT_SIZE                                0x3
#define _APMCLKPPS_PORT_LENGTH                              0x3
#define _APMCLKPPS_PORT_MASK                                0x38
#define _APMCLKPPS_APMCLKPPS0_POSN                          0x0
#define _APMCLKPPS_APMCLKPPS0_POSITION                      0x0
#define _APMCLKPPS_APMCLKPPS0_SIZE                          0x1
#define _APMCLKPPS_APMCLKPPS0_LENGTH                        0x1
#define _APMCLKPPS_APMCLKPPS0_MASK                          0x1
#define _APMCLKPPS_APMCLKPPS1_POSN                          0x1
#define _APMCLKPPS_APMCLKPPS1_POSITION                      0x1
#define _APMCLKPPS_APMCLKPPS1_SIZE                          0x1
#define _APMCLKPPS_APMCLKPPS1_LENGTH                        0x1
#define _APMCLKPPS_APMCLKPPS1_MASK                          0x2
#define _APMCLKPPS_APMCLKPPS2_POSN                          0x2
#define _APMCLKPPS_APMCLKPPS2_POSITION                      0x2
#define _APMCLKPPS_APMCLKPPS2_SIZE                          0x1
#define _APMCLKPPS_APMCLKPPS2_LENGTH                        0x1
#define _APMCLKPPS_APMCLKPPS2_MASK                          0x4
#define _APMCLKPPS_APMCLKPPS3_POSN                          0x3
#define _APMCLKPPS_APMCLKPPS3_POSITION                      0x3
#define _APMCLKPPS_APMCLKPPS3_SIZE                          0x1
#define _APMCLKPPS_APMCLKPPS3_LENGTH                        0x1
#define _APMCLKPPS_APMCLKPPS3_MASK                          0x8
#define _APMCLKPPS_APMCLKPPS4_POSN                          0x4
#define _APMCLKPPS_APMCLKPPS4_POSITION                      0x4
#define _APMCLKPPS_APMCLKPPS4_SIZE                          0x1
#define _APMCLKPPS_APMCLKPPS4_LENGTH                        0x1
#define _APMCLKPPS_APMCLKPPS4_MASK                          0x10
#define _APMCLKPPS_APMCLKPPS5_POSN                          0x5
#define _APMCLKPPS_APMCLKPPS5_POSITION                      0x5
#define _APMCLKPPS_APMCLKPPS5_SIZE                          0x1
#define _APMCLKPPS_APMCLKPPS5_LENGTH                        0x1
#define _APMCLKPPS_APMCLKPPS5_MASK                          0x20
#define _APMCLKPPS_APMCLKPPS_POSN                           0x0
#define _APMCLKPPS_APMCLKPPS_POSITION                       0x0
#define _APMCLKPPS_APMCLKPPS_SIZE                           0x6
#define _APMCLKPPS_APMCLKPPS_LENGTH                         0x6
#define _APMCLKPPS_APMCLKPPS_MASK                           0x3F

// Register: RC4I2C
#define RC4I2C RC4I2C
extern volatile unsigned char           RC4I2C              __at(0x285);
#ifndef _LIB_BUILD
asm("RC4I2C equ 0285h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :2;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
        unsigned SLEW0                  :1;
        unsigned SLEW1                  :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :2;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
        unsigned I2CSLEW0               :1;
        unsigned I2CSLEW1               :1;
    };
} RC4I2Cbits_t;
extern volatile RC4I2Cbits_t RC4I2Cbits __at(0x285);
// bitfield macros
#define _RC4I2C_TH_POSN                                     0x0
#define _RC4I2C_TH_POSITION                                 0x0
#define _RC4I2C_TH_SIZE                                     0x2
#define _RC4I2C_TH_LENGTH                                   0x2
#define _RC4I2C_TH_MASK                                     0x3
#define _RC4I2C_PU_POSN                                     0x4
#define _RC4I2C_PU_POSITION                                 0x4
#define _RC4I2C_PU_SIZE                                     0x2
#define _RC4I2C_PU_LENGTH                                   0x2
#define _RC4I2C_PU_MASK                                     0x30
#define _RC4I2C_SLEW_POSN                                   0x6
#define _RC4I2C_SLEW_POSITION                               0x6
#define _RC4I2C_SLEW_SIZE                                   0x2
#define _RC4I2C_SLEW_LENGTH                                 0x2
#define _RC4I2C_SLEW_MASK                                   0xC0
#define _RC4I2C_TH0_POSN                                    0x0
#define _RC4I2C_TH0_POSITION                                0x0
#define _RC4I2C_TH0_SIZE                                    0x1
#define _RC4I2C_TH0_LENGTH                                  0x1
#define _RC4I2C_TH0_MASK                                    0x1
#define _RC4I2C_TH1_POSN                                    0x1
#define _RC4I2C_TH1_POSITION                                0x1
#define _RC4I2C_TH1_SIZE                                    0x1
#define _RC4I2C_TH1_LENGTH                                  0x1
#define _RC4I2C_TH1_MASK                                    0x2
#define _RC4I2C_PU0_POSN                                    0x4
#define _RC4I2C_PU0_POSITION                                0x4
#define _RC4I2C_PU0_SIZE                                    0x1
#define _RC4I2C_PU0_LENGTH                                  0x1
#define _RC4I2C_PU0_MASK                                    0x10
#define _RC4I2C_PU1_POSN                                    0x5
#define _RC4I2C_PU1_POSITION                                0x5
#define _RC4I2C_PU1_SIZE                                    0x1
#define _RC4I2C_PU1_LENGTH                                  0x1
#define _RC4I2C_PU1_MASK                                    0x20
#define _RC4I2C_SLEW0_POSN                                  0x6
#define _RC4I2C_SLEW0_POSITION                              0x6
#define _RC4I2C_SLEW0_SIZE                                  0x1
#define _RC4I2C_SLEW0_LENGTH                                0x1
#define _RC4I2C_SLEW0_MASK                                  0x40
#define _RC4I2C_SLEW1_POSN                                  0x7
#define _RC4I2C_SLEW1_POSITION                              0x7
#define _RC4I2C_SLEW1_SIZE                                  0x1
#define _RC4I2C_SLEW1_LENGTH                                0x1
#define _RC4I2C_SLEW1_MASK                                  0x80
#define _RC4I2C_I2CTH_POSN                                  0x0
#define _RC4I2C_I2CTH_POSITION                              0x0
#define _RC4I2C_I2CTH_SIZE                                  0x2
#define _RC4I2C_I2CTH_LENGTH                                0x2
#define _RC4I2C_I2CTH_MASK                                  0x3
#define _RC4I2C_I2CPU_POSN                                  0x4
#define _RC4I2C_I2CPU_POSITION                              0x4
#define _RC4I2C_I2CPU_SIZE                                  0x2
#define _RC4I2C_I2CPU_LENGTH                                0x2
#define _RC4I2C_I2CPU_MASK                                  0x30
#define _RC4I2C_I2CSLEW_POSN                                0x6
#define _RC4I2C_I2CSLEW_POSITION                            0x6
#define _RC4I2C_I2CSLEW_SIZE                                0x2
#define _RC4I2C_I2CSLEW_LENGTH                              0x2
#define _RC4I2C_I2CSLEW_MASK                                0xC0
#define _RC4I2C_I2CTH0_POSN                                 0x0
#define _RC4I2C_I2CTH0_POSITION                             0x0
#define _RC4I2C_I2CTH0_SIZE                                 0x1
#define _RC4I2C_I2CTH0_LENGTH                               0x1
#define _RC4I2C_I2CTH0_MASK                                 0x1
#define _RC4I2C_I2CTH1_POSN                                 0x1
#define _RC4I2C_I2CTH1_POSITION                             0x1
#define _RC4I2C_I2CTH1_SIZE                                 0x1
#define _RC4I2C_I2CTH1_LENGTH                               0x1
#define _RC4I2C_I2CTH1_MASK                                 0x2
#define _RC4I2C_I2CPU0_POSN                                 0x4
#define _RC4I2C_I2CPU0_POSITION                             0x4
#define _RC4I2C_I2CPU0_SIZE                                 0x1
#define _RC4I2C_I2CPU0_LENGTH                               0x1
#define _RC4I2C_I2CPU0_MASK                                 0x10
#define _RC4I2C_I2CPU1_POSN                                 0x5
#define _RC4I2C_I2CPU1_POSITION                             0x5
#define _RC4I2C_I2CPU1_SIZE                                 0x1
#define _RC4I2C_I2CPU1_LENGTH                               0x1
#define _RC4I2C_I2CPU1_MASK                                 0x20
#define _RC4I2C_I2CSLEW0_POSN                               0x6
#define _RC4I2C_I2CSLEW0_POSITION                           0x6
#define _RC4I2C_I2CSLEW0_SIZE                               0x1
#define _RC4I2C_I2CSLEW0_LENGTH                             0x1
#define _RC4I2C_I2CSLEW0_MASK                               0x40
#define _RC4I2C_I2CSLEW1_POSN                               0x7
#define _RC4I2C_I2CSLEW1_POSITION                           0x7
#define _RC4I2C_I2CSLEW1_SIZE                               0x1
#define _RC4I2C_I2CSLEW1_LENGTH                             0x1
#define _RC4I2C_I2CSLEW1_MASK                               0x80

// Register: RC3I2C
#define RC3I2C RC3I2C
extern volatile unsigned char           RC3I2C              __at(0x286);
#ifndef _LIB_BUILD
asm("RC3I2C equ 0286h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :2;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
        unsigned SLEW0                  :1;
        unsigned SLEW1                  :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :2;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
        unsigned I2CSLEW0               :1;
        unsigned I2CSLEW1               :1;
    };
} RC3I2Cbits_t;
