garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f24q71.h
extern volatile I2C1ERRbits_t I2C1ERRbits __at(0x297);
// bitfield macros
#define _I2C1ERR_NACKIE_POSN                                0x0
#define _I2C1ERR_NACKIE_POSITION                            0x0
#define _I2C1ERR_NACKIE_SIZE                                0x1
#define _I2C1ERR_NACKIE_LENGTH                              0x1
#define _I2C1ERR_NACKIE_MASK                                0x1
#define _I2C1ERR_BCLIE_POSN                                 0x1
#define _I2C1ERR_BCLIE_POSITION                             0x1
#define _I2C1ERR_BCLIE_SIZE                                 0x1
#define _I2C1ERR_BCLIE_LENGTH                               0x1
#define _I2C1ERR_BCLIE_MASK                                 0x2
#define _I2C1ERR_BTOIE_POSN                                 0x2
#define _I2C1ERR_BTOIE_POSITION                             0x2
#define _I2C1ERR_BTOIE_SIZE                                 0x1
#define _I2C1ERR_BTOIE_LENGTH                               0x1
#define _I2C1ERR_BTOIE_MASK                                 0x4
#define _I2C1ERR_NACKIF_POSN                                0x4
#define _I2C1ERR_NACKIF_POSITION                            0x4
#define _I2C1ERR_NACKIF_SIZE                                0x1
#define _I2C1ERR_NACKIF_LENGTH                              0x1
#define _I2C1ERR_NACKIF_MASK                                0x10
#define _I2C1ERR_BCLIF_POSN                                 0x5
#define _I2C1ERR_BCLIF_POSITION                             0x5
#define _I2C1ERR_BCLIF_SIZE                                 0x1
#define _I2C1ERR_BCLIF_LENGTH                               0x1
#define _I2C1ERR_BCLIF_MASK                                 0x20
#define _I2C1ERR_BTOIF_POSN                                 0x6
#define _I2C1ERR_BTOIF_POSITION                             0x6
#define _I2C1ERR_BTOIF_SIZE                                 0x1
#define _I2C1ERR_BTOIF_LENGTH                               0x1
#define _I2C1ERR_BTOIF_MASK                                 0x40
#define _I2C1ERR_NACK1IE_POSN                               0x0
#define _I2C1ERR_NACK1IE_POSITION                           0x0
#define _I2C1ERR_NACK1IE_SIZE                               0x1
#define _I2C1ERR_NACK1IE_LENGTH                             0x1
#define _I2C1ERR_NACK1IE_MASK                               0x1
#define _I2C1ERR_BCL1IE_POSN                                0x1
#define _I2C1ERR_BCL1IE_POSITION                            0x1
#define _I2C1ERR_BCL1IE_SIZE                                0x1
#define _I2C1ERR_BCL1IE_LENGTH                              0x1
#define _I2C1ERR_BCL1IE_MASK                                0x2
#define _I2C1ERR_BTO1IE_POSN                                0x2
#define _I2C1ERR_BTO1IE_POSITION                            0x2
#define _I2C1ERR_BTO1IE_SIZE                                0x1
#define _I2C1ERR_BTO1IE_LENGTH                              0x1
#define _I2C1ERR_BTO1IE_MASK                                0x4
#define _I2C1ERR_NACK1IF_POSN                               0x4
#define _I2C1ERR_NACK1IF_POSITION                           0x4
#define _I2C1ERR_NACK1IF_SIZE                               0x1
#define _I2C1ERR_NACK1IF_LENGTH                             0x1
#define _I2C1ERR_NACK1IF_MASK                               0x10
#define _I2C1ERR_BCL1IF_POSN                                0x5
#define _I2C1ERR_BCL1IF_POSITION                            0x5
#define _I2C1ERR_BCL1IF_SIZE                                0x1
#define _I2C1ERR_BCL1IF_LENGTH                              0x1
#define _I2C1ERR_BCL1IF_MASK                                0x20
#define _I2C1ERR_BTO1IF_POSN                                0x6
#define _I2C1ERR_BTO1IF_POSITION                            0x6
#define _I2C1ERR_BTO1IF_SIZE                                0x1
#define _I2C1ERR_BTO1IF_LENGTH                              0x1
#define _I2C1ERR_BTO1IF_MASK                                0x40

// Register: I2C1STAT0
#define I2C1STAT0 I2C1STAT0
extern volatile unsigned char           I2C1STAT0           __at(0x298);
#ifndef _LIB_BUILD
asm("I2C1STAT0 equ 0298h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned D                      :1;
        unsigned R                      :1;
        unsigned MMA                    :1;
        unsigned SMA                    :1;
        unsigned BFRE                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned DATA                   :1;
        unsigned READ                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_ADDRESS            :1;
        unsigned NOT_WRITE              :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_A                  :1;
        unsigned NOT_W                  :1;
    };
} I2C1STAT0bits_t;
extern volatile I2C1STAT0bits_t I2C1STAT0bits __at(0x298);
// bitfield macros
#define _I2C1STAT0_D_POSN                                   0x3
#define _I2C1STAT0_D_POSITION                               0x3
#define _I2C1STAT0_D_SIZE                                   0x1
#define _I2C1STAT0_D_LENGTH                                 0x1
#define _I2C1STAT0_D_MASK                                   0x8
#define _I2C1STAT0_R_POSN                                   0x4
#define _I2C1STAT0_R_POSITION                               0x4
#define _I2C1STAT0_R_SIZE                                   0x1
#define _I2C1STAT0_R_LENGTH                                 0x1
#define _I2C1STAT0_R_MASK                                   0x10
#define _I2C1STAT0_MMA_POSN                                 0x5
#define _I2C1STAT0_MMA_POSITION                             0x5
#define _I2C1STAT0_MMA_SIZE                                 0x1
#define _I2C1STAT0_MMA_LENGTH                               0x1
#define _I2C1STAT0_MMA_MASK                                 0x20
#define _I2C1STAT0_SMA_POSN                                 0x6
#define _I2C1STAT0_SMA_POSITION                             0x6
#define _I2C1STAT0_SMA_SIZE                                 0x1
#define _I2C1STAT0_SMA_LENGTH                               0x1
#define _I2C1STAT0_SMA_MASK                                 0x40
#define _I2C1STAT0_BFRE_POSN                                0x7
#define _I2C1STAT0_BFRE_POSITION                            0x7
#define _I2C1STAT0_BFRE_SIZE                                0x1
#define _I2C1STAT0_BFRE_LENGTH                              0x1
#define _I2C1STAT0_BFRE_MASK                                0x80
#define _I2C1STAT0_DATA_POSN                                0x3
#define _I2C1STAT0_DATA_POSITION                            0x3
#define _I2C1STAT0_DATA_SIZE                                0x1
#define _I2C1STAT0_DATA_LENGTH                              0x1
#define _I2C1STAT0_DATA_MASK                                0x8
#define _I2C1STAT0_READ_POSN                                0x4
#define _I2C1STAT0_READ_POSITION                            0x4
#define _I2C1STAT0_READ_SIZE                                0x1
#define _I2C1STAT0_READ_LENGTH                              0x1
#define _I2C1STAT0_READ_MASK                                0x10
#define _I2C1STAT0_NOT_ADDRESS_POSN                         0x3
#define _I2C1STAT0_NOT_ADDRESS_POSITION                     0x3
#define _I2C1STAT0_NOT_ADDRESS_SIZE                         0x1
#define _I2C1STAT0_NOT_ADDRESS_LENGTH                       0x1
#define _I2C1STAT0_NOT_ADDRESS_MASK                         0x8
#define _I2C1STAT0_NOT_WRITE_POSN                           0x4
#define _I2C1STAT0_NOT_WRITE_POSITION                       0x4
#define _I2C1STAT0_NOT_WRITE_SIZE                           0x1
#define _I2C1STAT0_NOT_WRITE_LENGTH                         0x1
#define _I2C1STAT0_NOT_WRITE_MASK                           0x10
#define _I2C1STAT0_NOT_A_POSN                               0x3
#define _I2C1STAT0_NOT_A_POSITION                           0x3
#define _I2C1STAT0_NOT_A_SIZE                               0x1
#define _I2C1STAT0_NOT_A_LENGTH                             0x1
#define _I2C1STAT0_NOT_A_MASK                               0x8
#define _I2C1STAT0_NOT_W_POSN                               0x4
#define _I2C1STAT0_NOT_W_POSITION                           0x4
#define _I2C1STAT0_NOT_W_SIZE                               0x1
#define _I2C1STAT0_NOT_W_LENGTH                             0x1
#define _I2C1STAT0_NOT_W_MASK                               0x10

