garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f24q71.h
extern volatile TU16BPRLbits_t TU16BPRLbits __at(0x3B0);
// bitfield macros
#define _TU16BPRL_PRL_POSN                                  0x0
#define _TU16BPRL_PRL_POSITION                              0x0
#define _TU16BPRL_PRL_SIZE                                  0x8
#define _TU16BPRL_PRL_LENGTH                                0x8
#define _TU16BPRL_PRL_MASK                                  0xFF
#define _TU16BPRL_PRL0_POSN                                 0x0
#define _TU16BPRL_PRL0_POSITION                             0x0
#define _TU16BPRL_PRL0_SIZE                                 0x1
#define _TU16BPRL_PRL0_LENGTH                               0x1
#define _TU16BPRL_PRL0_MASK                                 0x1
#define _TU16BPRL_PRL1_POSN                                 0x1
#define _TU16BPRL_PRL1_POSITION                             0x1
#define _TU16BPRL_PRL1_SIZE                                 0x1
#define _TU16BPRL_PRL1_LENGTH                               0x1
#define _TU16BPRL_PRL1_MASK                                 0x2
#define _TU16BPRL_PRL2_POSN                                 0x2
#define _TU16BPRL_PRL2_POSITION                             0x2
#define _TU16BPRL_PRL2_SIZE                                 0x1
#define _TU16BPRL_PRL2_LENGTH                               0x1
#define _TU16BPRL_PRL2_MASK                                 0x4
#define _TU16BPRL_PRL3_POSN                                 0x3
#define _TU16BPRL_PRL3_POSITION                             0x3
#define _TU16BPRL_PRL3_SIZE                                 0x1
#define _TU16BPRL_PRL3_LENGTH                               0x1
#define _TU16BPRL_PRL3_MASK                                 0x8
#define _TU16BPRL_PRL4_POSN                                 0x4
#define _TU16BPRL_PRL4_POSITION                             0x4
#define _TU16BPRL_PRL4_SIZE                                 0x1
#define _TU16BPRL_PRL4_LENGTH                               0x1
#define _TU16BPRL_PRL4_MASK                                 0x10
#define _TU16BPRL_PRL5_POSN                                 0x5
#define _TU16BPRL_PRL5_POSITION                             0x5
#define _TU16BPRL_PRL5_SIZE                                 0x1
#define _TU16BPRL_PRL5_LENGTH                               0x1
#define _TU16BPRL_PRL5_MASK                                 0x20
#define _TU16BPRL_PRL6_POSN                                 0x6
#define _TU16BPRL_PRL6_POSITION                             0x6
#define _TU16BPRL_PRL6_SIZE                                 0x1
#define _TU16BPRL_PRL6_LENGTH                               0x1
#define _TU16BPRL_PRL6_MASK                                 0x40
#define _TU16BPRL_PRL7_POSN                                 0x7
#define _TU16BPRL_PRL7_POSITION                             0x7
#define _TU16BPRL_PRL7_SIZE                                 0x1
#define _TU16BPRL_PRL7_LENGTH                               0x1
#define _TU16BPRL_PRL7_MASK                                 0x80
#define _TU16BPRL_TU16BPRL0_POSN                            0x0
#define _TU16BPRL_TU16BPRL0_POSITION                        0x0
#define _TU16BPRL_TU16BPRL0_SIZE                            0x1
#define _TU16BPRL_TU16BPRL0_LENGTH                          0x1
#define _TU16BPRL_TU16BPRL0_MASK                            0x1
#define _TU16BPRL_TU16BPRL1_POSN                            0x1
#define _TU16BPRL_TU16BPRL1_POSITION                        0x1
#define _TU16BPRL_TU16BPRL1_SIZE                            0x1
#define _TU16BPRL_TU16BPRL1_LENGTH                          0x1
#define _TU16BPRL_TU16BPRL1_MASK                            0x2
#define _TU16BPRL_TU16BPRL2_POSN                            0x2
#define _TU16BPRL_TU16BPRL2_POSITION                        0x2
#define _TU16BPRL_TU16BPRL2_SIZE                            0x1
#define _TU16BPRL_TU16BPRL2_LENGTH                          0x1
#define _TU16BPRL_TU16BPRL2_MASK                            0x4
#define _TU16BPRL_TU16BPRL3_POSN                            0x3
#define _TU16BPRL_TU16BPRL3_POSITION                        0x3
#define _TU16BPRL_TU16BPRL3_SIZE                            0x1
#define _TU16BPRL_TU16BPRL3_LENGTH                          0x1
#define _TU16BPRL_TU16BPRL3_MASK                            0x8
#define _TU16BPRL_TU16BPRL4_POSN                            0x4
#define _TU16BPRL_TU16BPRL4_POSITION                        0x4
#define _TU16BPRL_TU16BPRL4_SIZE                            0x1
#define _TU16BPRL_TU16BPRL4_LENGTH                          0x1
#define _TU16BPRL_TU16BPRL4_MASK                            0x10
#define _TU16BPRL_TU16BPRL5_POSN                            0x5
#define _TU16BPRL_TU16BPRL5_POSITION                        0x5
#define _TU16BPRL_TU16BPRL5_SIZE                            0x1
#define _TU16BPRL_TU16BPRL5_LENGTH                          0x1
#define _TU16BPRL_TU16BPRL5_MASK                            0x20
#define _TU16BPRL_TU16BPRL6_POSN                            0x6
#define _TU16BPRL_TU16BPRL6_POSITION                        0x6
#define _TU16BPRL_TU16BPRL6_SIZE                            0x1
#define _TU16BPRL_TU16BPRL6_LENGTH                          0x1
#define _TU16BPRL_TU16BPRL6_MASK                            0x40
#define _TU16BPRL_TU16BPRL7_POSN                            0x7
#define _TU16BPRL_TU16BPRL7_POSITION                        0x7
#define _TU16BPRL_TU16BPRL7_SIZE                            0x1
#define _TU16BPRL_TU16BPRL7_LENGTH                          0x1
#define _TU16BPRL_TU16BPRL7_MASK                            0x80
#define _TU16BPRL_TU16BPR0_POSN                             0x0
#define _TU16BPRL_TU16BPR0_POSITION                         0x0
#define _TU16BPRL_TU16BPR0_SIZE                             0x1
#define _TU16BPRL_TU16BPR0_LENGTH                           0x1
#define _TU16BPRL_TU16BPR0_MASK                             0x1
#define _TU16BPRL_TU16BPR1_POSN                             0x1
#define _TU16BPRL_TU16BPR1_POSITION                         0x1
#define _TU16BPRL_TU16BPR1_SIZE                             0x1
#define _TU16BPRL_TU16BPR1_LENGTH                           0x1
#define _TU16BPRL_TU16BPR1_MASK                             0x2
#define _TU16BPRL_TU16BPR2_POSN                             0x2
#define _TU16BPRL_TU16BPR2_POSITION                         0x2
#define _TU16BPRL_TU16BPR2_SIZE                             0x1
#define _TU16BPRL_TU16BPR2_LENGTH                           0x1
#define _TU16BPRL_TU16BPR2_MASK                             0x4
#define _TU16BPRL_TU16BPR3_POSN                             0x3
#define _TU16BPRL_TU16BPR3_POSITION                         0x3
#define _TU16BPRL_TU16BPR3_SIZE                             0x1
#define _TU16BPRL_TU16BPR3_LENGTH                           0x1
#define _TU16BPRL_TU16BPR3_MASK                             0x8
#define _TU16BPRL_TU16BPR4_POSN                             0x4
#define _TU16BPRL_TU16BPR4_POSITION                         0x4
#define _TU16BPRL_TU16BPR4_SIZE                             0x1
#define _TU16BPRL_TU16BPR4_LENGTH                           0x1
#define _TU16BPRL_TU16BPR4_MASK                             0x10
#define _TU16BPRL_TU16BPR5_POSN                             0x5
#define _TU16BPRL_TU16BPR5_POSITION                         0x5
#define _TU16BPRL_TU16BPR5_SIZE                             0x1
#define _TU16BPRL_TU16BPR5_LENGTH                           0x1
#define _TU16BPRL_TU16BPR5_MASK                             0x20
#define _TU16BPRL_TU16BPR6_POSN                             0x6
#define _TU16BPRL_TU16BPR6_POSITION                         0x6
#define _TU16BPRL_TU16BPR6_SIZE                             0x1
#define _TU16BPRL_TU16BPR6_LENGTH                           0x1
#define _TU16BPRL_TU16BPR6_MASK                             0x40
#define _TU16BPRL_TU16BPR7_POSN                             0x7
#define _TU16BPRL_TU16BPR7_POSITION                         0x7
#define _TU16BPRL_TU16BPR7_SIZE                             0x1
#define _TU16BPRL_TU16BPR7_LENGTH                           0x1
#define _TU16BPRL_TU16BPR7_MASK                             0x80

