garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f24q71.h
extern volatile __bit                   DAC2R0              __at(0x600);	// @ (0xC0 * 8 + 0)
#define                                 DAC2R0_bit          _BIT_ACCESS(DAC2DATL,0)
// DAC2DATL<DAC2R1>
extern volatile __bit                   DAC2R1              __at(0x601);	// @ (0xC0 * 8 + 1)
#define                                 DAC2R1_bit          _BIT_ACCESS(DAC2DATL,1)
// DAC2DATL<DAC2R2>
extern volatile __bit                   DAC2R2              __at(0x602);	// @ (0xC0 * 8 + 2)
#define                                 DAC2R2_bit          _BIT_ACCESS(DAC2DATL,2)
// DAC2DATL<DAC2R3>
extern volatile __bit                   DAC2R3              __at(0x603);	// @ (0xC0 * 8 + 3)
#define                                 DAC2R3_bit          _BIT_ACCESS(DAC2DATL,3)
// DAC2DATL<DAC2R4>
extern volatile __bit                   DAC2R4              __at(0x604);	// @ (0xC0 * 8 + 4)
#define                                 DAC2R4_bit          _BIT_ACCESS(DAC2DATL,4)
// DAC2DATL<DAC2R5>
extern volatile __bit                   DAC2R5              __at(0x605);	// @ (0xC0 * 8 + 5)
#define                                 DAC2R5_bit          _BIT_ACCESS(DAC2DATL,5)
// DAC2DATL<DAC2R6>
extern volatile __bit                   DAC2R6              __at(0x606);	// @ (0xC0 * 8 + 6)
#define                                 DAC2R6_bit          _BIT_ACCESS(DAC2DATL,6)
// DAC2DATL<DAC2R7>
extern volatile __bit                   DAC2R7              __at(0x607);	// @ (0xC0 * 8 + 7)
#define                                 DAC2R7_bit          _BIT_ACCESS(DAC2DATL,7)
// DAC3CON<DAC3EN>
extern volatile __bit                   DAC3EN              __at(0x62F);	// @ (0xC5 * 8 + 7)
#define                                 DAC3EN_bit          _BIT_ACCESS(DAC3CON,7)
// PMD6<DAC3MD>
extern volatile __bit                   DAC3MD              __at(0x342);	// @ (0x68 * 8 + 2)
#define                                 DAC3MD_bit          _BIT_ACCESS(PMD6,2)
// DAC3CON<DAC3PSS0>
extern volatile __bit                   DAC3PSS0            __at(0x62A);	// @ (0xC5 * 8 + 2)
#define                                 DAC3PSS0_bit        _BIT_ACCESS(DAC3CON,2)
// DAC3CON<DAC3PSS1>
extern volatile __bit                   DAC3PSS1            __at(0x62B);	// @ (0xC5 * 8 + 3)
#define                                 DAC3PSS1_bit        _BIT_ACCESS(DAC3CON,3)
// DAC3DATL<DAC3R0>
extern volatile __bit                   DAC3R0              __at(0x618);	// @ (0xC3 * 8 + 0)
#define                                 DAC3R0_bit          _BIT_ACCESS(DAC3DATL,0)
// DAC3DATL<DAC3R1>
extern volatile __bit                   DAC3R1              __at(0x619);	// @ (0xC3 * 8 + 1)
#define                                 DAC3R1_bit          _BIT_ACCESS(DAC3DATL,1)
// DAC3DATL<DAC3R2>
extern volatile __bit                   DAC3R2              __at(0x61A);	// @ (0xC3 * 8 + 2)
#define                                 DAC3R2_bit          _BIT_ACCESS(DAC3DATL,2)
// DAC3DATL<DAC3R3>
extern volatile __bit                   DAC3R3              __at(0x61B);	// @ (0xC3 * 8 + 3)
#define                                 DAC3R3_bit          _BIT_ACCESS(DAC3DATL,3)
// DAC3DATL<DAC3R4>
extern volatile __bit                   DAC3R4              __at(0x61C);	// @ (0xC3 * 8 + 4)
#define                                 DAC3R4_bit          _BIT_ACCESS(DAC3DATL,4)
// DAC3DATL<DAC3R5>
extern volatile __bit                   DAC3R5              __at(0x61D);	// @ (0xC3 * 8 + 5)
#define                                 DAC3R5_bit          _BIT_ACCESS(DAC3DATL,5)
// DAC3DATL<DAC3R6>
extern volatile __bit                   DAC3R6              __at(0x61E);	// @ (0xC3 * 8 + 6)
#define                                 DAC3R6_bit          _BIT_ACCESS(DAC3DATL,6)
// DAC3DATL<DAC3R7>
extern volatile __bit                   DAC3R7              __at(0x61F);	// @ (0xC3 * 8 + 7)
#define                                 DAC3R7_bit          _BIT_ACCESS(DAC3DATL,7)
// I2C1STAT0<DATA>
extern volatile __bit                   DATA                __at(0x14C3);	// @ (0x298 * 8 + 3)
#define                                 DATA_bit            _BIT_ACCESS(I2C1STAT0,3)
// CRCDATAL<DATA0>
extern volatile __bit                   DATA0               __at(0x1A70);	// @ (0x34E * 8 + 0)
#define                                 DATA0_bit           _BIT_ACCESS(CRCDATAL,0)
// CRCDATAL<DATA1>
extern volatile __bit                   DATA1               __at(0x1A71);	// @ (0x34E * 8 + 1)
#define                                 DATA1_bit           _BIT_ACCESS(CRCDATAL,1)
// CRCDATAH<DATA10>
extern volatile __bit                   DATA10              __at(0x1A7A);	// @ (0x34F * 8 + 2)
#define                                 DATA10_bit          _BIT_ACCESS(CRCDATAH,2)
// CRCDATAH<DATA11>
extern volatile __bit                   DATA11              __at(0x1A7B);	// @ (0x34F * 8 + 3)
#define                                 DATA11_bit          _BIT_ACCESS(CRCDATAH,3)
// CRCDATAH<DATA12>
extern volatile __bit                   DATA12              __at(0x1A7C);	// @ (0x34F * 8 + 4)
#define                                 DATA12_bit          _BIT_ACCESS(CRCDATAH,4)
// CRCDATAH<DATA13>
extern volatile __bit                   DATA13              __at(0x1A7D);	// @ (0x34F * 8 + 5)
#define                                 DATA13_bit          _BIT_ACCESS(CRCDATAH,5)
// CRCDATAH<DATA14>
extern volatile __bit                   DATA14              __at(0x1A7E);	// @ (0x34F * 8 + 6)
#define                                 DATA14_bit          _BIT_ACCESS(CRCDATAH,6)
// CRCDATAH<DATA15>
extern volatile __bit                   DATA15              __at(0x1A7F);	// @ (0x34F * 8 + 7)
#define                                 DATA15_bit          _BIT_ACCESS(CRCDATAH,7)
// CRCDATAU<DATA16>
extern volatile __bit                   DATA16              __at(0x1A80);	// @ (0x350 * 8 + 0)
#define                                 DATA16_bit          _BIT_ACCESS(CRCDATAU,0)
// CRCDATAU<DATA17>
extern volatile __bit                   DATA17              __at(0x1A81);	// @ (0x350 * 8 + 1)
#define                                 DATA17_bit          _BIT_ACCESS(CRCDATAU,1)
// CRCDATAU<DATA18>
extern volatile __bit                   DATA18              __at(0x1A82);	// @ (0x350 * 8 + 2)
#define                                 DATA18_bit          _BIT_ACCESS(CRCDATAU,2)
// CRCDATAU<DATA19>
extern volatile __bit                   DATA19              __at(0x1A83);	// @ (0x350 * 8 + 3)
#define                                 DATA19_bit          _BIT_ACCESS(CRCDATAU,3)
// CRCDATAL<DATA2>
extern volatile __bit                   DATA2               __at(0x1A72);	// @ (0x34E * 8 + 2)
#define                                 DATA2_bit           _BIT_ACCESS(CRCDATAL,2)
// CRCDATAU<DATA20>
extern volatile __bit                   DATA20              __at(0x1A84);	// @ (0x350 * 8 + 4)
#define                                 DATA20_bit          _BIT_ACCESS(CRCDATAU,4)
// CRCDATAU<DATA21>
extern volatile __bit                   DATA21              __at(0x1A85);	// @ (0x350 * 8 + 5)
#define                                 DATA21_bit          _BIT_ACCESS(CRCDATAU,5)
// CRCDATAU<DATA22>
extern volatile __bit                   DATA22              __at(0x1A86);	// @ (0x350 * 8 + 6)
#define                                 DATA22_bit          _BIT_ACCESS(CRCDATAU,6)
// CRCDATAU<DATA23>
extern volatile __bit                   DATA23              __at(0x1A87);	// @ (0x350 * 8 + 7)
#define                                 DATA23_bit          _BIT_ACCESS(CRCDATAU,7)
// CRCDATAT<DATA24>
extern volatile __bit                   DATA24              __at(0x1A88);	// @ (0x351 * 8 + 0)
#define                                 DATA24_bit          _BIT_ACCESS(CRCDATAT,0)
// CRCDATAT<DATA25>
extern volatile __bit                   DATA25              __at(0x1A89);	// @ (0x351 * 8 + 1)
#define                                 DATA25_bit          _BIT_ACCESS(CRCDATAT,1)
// CRCDATAT<DATA26>
extern volatile __bit                   DATA26              __at(0x1A8A);	// @ (0x351 * 8 + 2)
#define                                 DATA26_bit          _BIT_ACCESS(CRCDATAT,2)
// CRCDATAT<DATA27>
extern volatile __bit                   DATA27              __at(0x1A8B);	// @ (0x351 * 8 + 3)
#define                                 DATA27_bit          _BIT_ACCESS(CRCDATAT,3)
// CRCDATAT<DATA28>
extern volatile __bit                   DATA28              __at(0x1A8C);	// @ (0x351 * 8 + 4)
#define                                 DATA28_bit          _BIT_ACCESS(CRCDATAT,4)
// CRCDATAT<DATA29>
extern volatile __bit                   DATA29              __at(0x1A8D);	// @ (0x351 * 8 + 5)
#define                                 DATA29_bit          _BIT_ACCESS(CRCDATAT,5)
// CRCDATAL<DATA3>
extern volatile __bit                   DATA3               __at(0x1A73);	// @ (0x34E * 8 + 3)
#define                                 DATA3_bit           _BIT_ACCESS(CRCDATAL,3)
// CRCDATAT<DATA30>
extern volatile __bit                   DATA30              __at(0x1A8E);	// @ (0x351 * 8 + 6)
#define                                 DATA30_bit          _BIT_ACCESS(CRCDATAT,6)
// CRCDATAT<DATA31>
extern volatile __bit                   DATA31              __at(0x1A8F);	// @ (0x351 * 8 + 7)
#define                                 DATA31_bit          _BIT_ACCESS(CRCDATAT,7)
// CRCDATAL<DATA4>
extern volatile __bit                   DATA4               __at(0x1A74);	// @ (0x34E * 8 + 4)
#define                                 DATA4_bit           _BIT_ACCESS(CRCDATAL,4)
// CRCDATAL<DATA5>
extern volatile __bit                   DATA5               __at(0x1A75);	// @ (0x34E * 8 + 5)
#define                                 DATA5_bit           _BIT_ACCESS(CRCDATAL,5)
// CRCDATAL<DATA6>
extern volatile __bit                   DATA6               __at(0x1A76);	// @ (0x34E * 8 + 6)
#define                                 DATA6_bit           _BIT_ACCESS(CRCDATAL,6)
// CRCDATAL<DATA7>
extern volatile __bit                   DATA7               __at(0x1A77);	// @ (0x34E * 8 + 7)
#define                                 DATA7_bit           _BIT_ACCESS(CRCDATAL,7)
// CRCDATAH<DATA8>
extern volatile __bit                   DATA8               __at(0x1A78);	// @ (0x34F * 8 + 0)
#define                                 DATA8_bit           _BIT_ACCESS(CRCDATAH,0)
// CRCDATAH<DATA9>
extern volatile __bit                   DATA9               __at(0x1A79);	// @ (0x34F * 8 + 1)
#define                                 DATA9_bit           _BIT_ACCESS(CRCDATAH,1)
// CWG1DBF<DBF0>
extern volatile __bit                   DBF0                __at(0x1DF8);	// @ (0x3BF * 8 + 0)
#define                                 DBF0_bit            _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<DBF1>
extern volatile __bit                   DBF1                __at(0x1DF9);	// @ (0x3BF * 8 + 1)
#define                                 DBF1_bit            _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<DBF2>
extern volatile __bit                   DBF2                __at(0x1DFA);	// @ (0x3BF * 8 + 2)
#define                                 DBF2_bit            _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<DBF3>
extern volatile __bit                   DBF3                __at(0x1DFB);	// @ (0x3BF * 8 + 3)
#define                                 DBF3_bit            _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<DBF4>
extern volatile __bit                   DBF4                __at(0x1DFC);	// @ (0x3BF * 8 + 4)
#define                                 DBF4_bit            _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<DBF5>
extern volatile __bit                   DBF5                __at(0x1DFD);	// @ (0x3BF * 8 + 5)
#define                                 DBF5_bit            _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<DBR0>
extern volatile __bit                   DBR0                __at(0x1DF0);	// @ (0x3BE * 8 + 0)
#define                                 DBR0_bit            _BIT_ACCESS(CWG1DBR,0)
// CWG1DBR<DBR1>
extern volatile __bit                   DBR1                __at(0x1DF1);	// @ (0x3BE * 8 + 1)
#define                                 DBR1_bit            _BIT_ACCESS(CWG1DBR,1)
// CWG1DBR<DBR2>
extern volatile __bit                   DBR2                __at(0x1DF2);	// @ (0x3BE * 8 + 2)
#define                                 DBR2_bit            _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<DBR3>
extern volatile __bit                   DBR3                __at(0x1DF3);	// @ (0x3BE * 8 + 3)
#define                                 DBR3_bit            _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<DBR4>
extern volatile __bit                   DBR4                __at(0x1DF4);	// @ (0x3BE * 8 + 4)
#define                                 DBR4_bit            _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<DBR5>
extern volatile __bit                   DBR5                __at(0x1DF5);	// @ (0x3BE * 8 + 5)
#define                                 DBR5_bit            _BIT_ACCESS(CWG1DBR,5)
// CLKRCON<DC0>
extern volatile __bit                   DC0                 __at(0x1CB);	// @ (0x39 * 8 + 3)
#define                                 DC0_bit             _BIT_ACCESS(CLKRCON,3)
// CLKRCON<DC1>
extern volatile __bit                   DC1                 __at(0x1CC);	// @ (0x39 * 8 + 4)
#define                                 DC1_bit             _BIT_ACCESS(CLKRCON,4)
// DMAnDCNTL<DCNT0>
extern volatile __bit                   DCNT0               __at(0x750);	// @ (0xEA * 8 + 0)
#define                                 DCNT0_bit           _BIT_ACCESS(DMAnDCNTL,0)
// DMAnDCNTL<DCNT1>
extern volatile __bit                   DCNT1               __at(0x751);	// @ (0xEA * 8 + 1)
#define                                 DCNT1_bit           _BIT_ACCESS(DMAnDCNTL,1)
// DMAnDCNTH<DCNT10>
extern volatile __bit                   DCNT10              __at(0x75A);	// @ (0xEB * 8 + 2)
#define                                 DCNT10_bit          _BIT_ACCESS(DMAnDCNTH,2)
// DMAnDCNTH<DCNT11>
extern volatile __bit                   DCNT11              __at(0x75B);	// @ (0xEB * 8 + 3)
#define                                 DCNT11_bit          _BIT_ACCESS(DMAnDCNTH,3)
// DMAnDCNTL<DCNT2>
extern volatile __bit                   DCNT2               __at(0x752);	// @ (0xEA * 8 + 2)
#define                                 DCNT2_bit           _BIT_ACCESS(DMAnDCNTL,2)
// DMAnDCNTL<DCNT3>
extern volatile __bit                   DCNT3               __at(0x753);	// @ (0xEA * 8 + 3)
#define                                 DCNT3_bit           _BIT_ACCESS(DMAnDCNTL,3)
// DMAnDCNTL<DCNT4>
extern volatile __bit                   DCNT4               __at(0x754);	// @ (0xEA * 8 + 4)
#define                                 DCNT4_bit           _BIT_ACCESS(DMAnDCNTL,4)
// DMAnDCNTL<DCNT5>
extern volatile __bit                   DCNT5               __at(0x755);	// @ (0xEA * 8 + 5)
#define                                 DCNT5_bit           _BIT_ACCESS(DMAnDCNTL,5)
// DMAnDCNTL<DCNT6>
extern volatile __bit                   DCNT6               __at(0x756);	// @ (0xEA * 8 + 6)
#define                                 DCNT6_bit           _BIT_ACCESS(DMAnDCNTL,6)
// DMAnDCNTL<DCNT7>
extern volatile __bit                   DCNT7               __at(0x757);	// @ (0xEA * 8 + 7)
#define                                 DCNT7_bit           _BIT_ACCESS(DMAnDCNTL,7)
// DMAnDCNTH<DCNT8>
extern volatile __bit                   DCNT8               __at(0x758);	// @ (0xEB * 8 + 0)
#define                                 DCNT8_bit           _BIT_ACCESS(DMAnDCNTH,0)
// DMAnDCNTH<DCNT9>
extern volatile __bit                   DCNT9               __at(0x759);	// @ (0xEB * 8 + 1)
#define                                 DCNT9_bit           _BIT_ACCESS(DMAnDCNTH,1)
// PORTWDF<DF0>
extern volatile __bit                   DF0                 __at(0x858);	// @ (0x10B * 8 + 0)
#define                                 DF0_bit             _BIT_ACCESS(PORTWDF,0)
// PORTWDF<DF1>
extern volatile __bit                   DF1                 __at(0x859);	// @ (0x10B * 8 + 1)
#define                                 DF1_bit             _BIT_ACCESS(PORTWDF,1)
// PORTWDF<DF2>
extern volatile __bit                   DF2                 __at(0x85A);	// @ (0x10B * 8 + 2)
#define                                 DF2_bit             _BIT_ACCESS(PORTWDF,2)
// PORTWDF<DF3>
extern volatile __bit                   DF3                 __at(0x85B);	// @ (0x10B * 8 + 3)
#define                                 DF3_bit             _BIT_ACCESS(PORTWDF,3)
// PORTWDF<DF4>
extern volatile __bit                   DF4                 __at(0x85C);	// @ (0x10B * 8 + 4)
#define                                 DF4_bit             _BIT_ACCESS(PORTWDF,4)
// PORTWDF<DF5>
extern volatile __bit                   DF5                 __at(0x85D);	// @ (0x10B * 8 + 5)
#define                                 DF5_bit             _BIT_ACCESS(PORTWDF,5)
// PORTWDF<DF6>
extern volatile __bit                   DF6                 __at(0x85E);	// @ (0x10B * 8 + 6)
#define                                 DF6_bit             _BIT_ACCESS(PORTWDF,6)
// PORTWDF<DF7>
extern volatile __bit                   DF7                 __at(0x85F);	// @ (0x10B * 8 + 7)
#define                                 DF7_bit             _BIT_ACCESS(PORTWDF,7)
// DMAnCON0<DGO>
extern volatile __bit                   DGO                 __at(0x7E5);	// @ (0xFC * 8 + 5)
#define                                 DGO_bit             _BIT_ACCESS(DMAnCON0,5)
// CLKRCON<DIV0>
extern volatile __bit                   DIV0                __at(0x1C8);	// @ (0x39 * 8 + 0)
#define                                 DIV0_bit            _BIT_ACCESS(CLKRCON,0)
// CLKRCON<DIV1>
extern volatile __bit                   DIV1                __at(0x1C9);	// @ (0x39 * 8 + 1)
#define                                 DIV1_bit            _BIT_ACCESS(CLKRCON,1)
// CLKRCON<DIV2>
extern volatile __bit                   DIV2                __at(0x1CA);	// @ (0x39 * 8 + 2)
#define                                 DIV2_bit            _BIT_ACCESS(CLKRCON,2)
// CRCCON2<DLEN0>
extern volatile __bit                   DLEN0               __at(0x1AC0);	// @ (0x358 * 8 + 0)
#define                                 DLEN0_bit           _BIT_ACCESS(CRCCON2,0)
// CRCCON2<DLEN1>
extern volatile __bit                   DLEN1               __at(0x1AC1);	// @ (0x358 * 8 + 1)
#define                                 DLEN1_bit           _BIT_ACCESS(CRCCON2,1)
// CRCCON2<DLEN2>
extern volatile __bit                   DLEN2               __at(0x1AC2);	// @ (0x358 * 8 + 2)
#define                                 DLEN2_bit           _BIT_ACCESS(CRCCON2,2)
// CRCCON2<DLEN3>
extern volatile __bit                   DLEN3               __at(0x1AC3);	// @ (0x358 * 8 + 3)
#define                                 DLEN3_bit           _BIT_ACCESS(CRCCON2,3)
// CRCCON2<DLEN4>
extern volatile __bit                   DLEN4               __at(0x1AC4);	// @ (0x358 * 8 + 4)
#define                                 DLEN4_bit           _BIT_ACCESS(CRCCON2,4)
// PIE2<DMA1AIE>
extern volatile __bit                   DMA1AIE             __at(0x254F);	// @ (0x4A9 * 8 + 7)
#define                                 DMA1AIE_bit         _BIT_ACCESS(PIE2,7)
// PIR2<DMA1AIF>
extern volatile __bit                   DMA1AIF             __at(0x25A7);	// @ (0x4B4 * 8 + 7)
#define                                 DMA1AIF_bit         _BIT_ACCESS(PIR2,7)
// IPR2<DMA1AIP>
extern volatile __bit                   DMA1AIP             __at(0x24F7);	// @ (0x49E * 8 + 7)
#define                                 DMA1AIP_bit         _BIT_ACCESS(IPR2,7)
// PIE2<DMA1DCNTIE>
extern volatile __bit                   DMA1DCNTIE          __at(0x254D);	// @ (0x4A9 * 8 + 5)
#define                                 DMA1DCNTIE_bit      _BIT_ACCESS(PIE2,5)
// PIR2<DMA1DCNTIF>
extern volatile __bit                   DMA1DCNTIF          __at(0x25A5);	// @ (0x4B4 * 8 + 5)
#define                                 DMA1DCNTIF_bit      _BIT_ACCESS(PIR2,5)
// IPR2<DMA1DCNTIP>
extern volatile __bit                   DMA1DCNTIP          __at(0x24F5);	// @ (0x49E * 8 + 5)
#define                                 DMA1DCNTIP_bit      _BIT_ACCESS(IPR2,5)
// PMD4<DMA1MD>
extern volatile __bit                   DMA1MD              __at(0x335);	// @ (0x66 * 8 + 5)
#define                                 DMA1MD_bit          _BIT_ACCESS(PMD4,5)
// PIE2<DMA1ORIE>
extern volatile __bit                   DMA1ORIE            __at(0x254E);	// @ (0x4A9 * 8 + 6)
#define                                 DMA1ORIE_bit        _BIT_ACCESS(PIE2,6)
// PIR2<DMA1ORIF>
extern volatile __bit                   DMA1ORIF            __at(0x25A6);	// @ (0x4B4 * 8 + 6)
#define                                 DMA1ORIF_bit        _BIT_ACCESS(PIR2,6)
// IPR2<DMA1ORIP>
extern volatile __bit                   DMA1ORIP            __at(0x24F6);	// @ (0x49E * 8 + 6)
#define                                 DMA1ORIP_bit        _BIT_ACCESS(IPR2,6)
// DMA1PR<DMA1PR0>
extern volatile __bit                   DMA1PR0             __at(0x5B0);	// @ (0xB6 * 8 + 0)
#define                                 DMA1PR0_bit         _BIT_ACCESS(DMA1PR,0)
// DMA1PR<DMA1PR1>
extern volatile __bit                   DMA1PR1             __at(0x5B1);	// @ (0xB6 * 8 + 1)
#define                                 DMA1PR1_bit         _BIT_ACCESS(DMA1PR,1)
// DMA1PR<DMA1PR2>
extern volatile __bit                   DMA1PR2             __at(0x5B2);	// @ (0xB6 * 8 + 2)
#define                                 DMA1PR2_bit         _BIT_ACCESS(DMA1PR,2)
// PIE2<DMA1SCNTIE>
extern volatile __bit                   DMA1SCNTIE          __at(0x254C);	// @ (0x4A9 * 8 + 4)
#define                                 DMA1SCNTIE_bit      _BIT_ACCESS(PIE2,4)
// PIR2<DMA1SCNTIF>
extern volatile __bit                   DMA1SCNTIF          __at(0x25A4);	// @ (0x4B4 * 8 + 4)
#define                                 DMA1SCNTIF_bit      _BIT_ACCESS(PIR2,4)
// IPR2<DMA1SCNTIP>
extern volatile __bit                   DMA1SCNTIP          __at(0x24F4);	// @ (0x49E * 8 + 4)
#define                                 DMA1SCNTIP_bit      _BIT_ACCESS(IPR2,4)
// PIE6<DMA2AIE>
extern volatile __bit                   DMA2AIE             __at(0x256F);	// @ (0x4AD * 8 + 7)
#define                                 DMA2AIE_bit         _BIT_ACCESS(PIE6,7)
// PIR6<DMA2AIF>
extern volatile __bit                   DMA2AIF             __at(0x25C7);	// @ (0x4B8 * 8 + 7)
#define                                 DMA2AIF_bit         _BIT_ACCESS(PIR6,7)
// IPR6<DMA2AIP>
extern volatile __bit                   DMA2AIP             __at(0x2517);	// @ (0x4A2 * 8 + 7)
#define                                 DMA2AIP_bit         _BIT_ACCESS(IPR6,7)
// PIE6<DMA2DCNTIE>
extern volatile __bit                   DMA2DCNTIE          __at(0x256D);	// @ (0x4AD * 8 + 5)
#define                                 DMA2DCNTIE_bit      _BIT_ACCESS(PIE6,5)
// PIR6<DMA2DCNTIF>
extern volatile __bit                   DMA2DCNTIF          __at(0x25C5);	// @ (0x4B8 * 8 + 5)
#define                                 DMA2DCNTIF_bit      _BIT_ACCESS(PIR6,5)
// IPR6<DMA2DCNTIP>
extern volatile __bit                   DMA2DCNTIP          __at(0x2515);	// @ (0x4A2 * 8 + 5)
#define                                 DMA2DCNTIP_bit      _BIT_ACCESS(IPR6,5)
// PMD4<DMA2MD>
extern volatile __bit                   DMA2MD              __at(0x336);	// @ (0x66 * 8 + 6)
#define                                 DMA2MD_bit          _BIT_ACCESS(PMD4,6)
// PIE6<DMA2ORIE>
extern volatile __bit                   DMA2ORIE            __at(0x256E);	// @ (0x4AD * 8 + 6)
#define                                 DMA2ORIE_bit        _BIT_ACCESS(PIE6,6)
// PIR6<DMA2ORIF>
extern volatile __bit                   DMA2ORIF            __at(0x25C6);	// @ (0x4B8 * 8 + 6)
#define                                 DMA2ORIF_bit        _BIT_ACCESS(PIR6,6)
// IPR6<DMA2ORIP>
extern volatile __bit                   DMA2ORIP            __at(0x2516);	// @ (0x4A2 * 8 + 6)
#define                                 DMA2ORIP_bit        _BIT_ACCESS(IPR6,6)
// DMA2PR<DMA2PR0>
