garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f24q71.h
#define                                 I2C1IE_bit          _BIT_ACCESS(PIE7,2)
// PIR7<I2C1IF>
extern volatile __bit                   I2C1IF              __at(0x25CA);	// @ (0x4B9 * 8 + 2)
#define                                 I2C1IF_bit          _BIT_ACCESS(PIR7,2)
// IPR7<I2C1IP>
extern volatile __bit                   I2C1IP              __at(0x251A);	// @ (0x4A3 * 8 + 2)
#define                                 I2C1IP_bit          _BIT_ACCESS(IPR7,2)
// PMD3<I2C1MD>
extern volatile __bit                   I2C1MD              __at(0x32B);	// @ (0x65 * 8 + 3)
#define                                 I2C1MD_bit          _BIT_ACCESS(PMD3,3)
// PIE7<I2C1RXIE>
extern volatile __bit                   I2C1RXIE            __at(0x2570);	// @ (0x4AE * 8 + 0)
#define                                 I2C1RXIE_bit        _BIT_ACCESS(PIE7,0)
// PIR7<I2C1RXIF>
extern volatile __bit                   I2C1RXIF            __at(0x25C8);	// @ (0x4B9 * 8 + 0)
#define                                 I2C1RXIF_bit        _BIT_ACCESS(PIR7,0)
// IPR7<I2C1RXIP>
extern volatile __bit                   I2C1RXIP            __at(0x2518);	// @ (0x4A3 * 8 + 0)
#define                                 I2C1RXIP_bit        _BIT_ACCESS(IPR7,0)
// I2C1SCLPPS<I2C1SCLPPS0>
extern volatile __bit                   I2C1SCLPPS0         __at(0x1388);	// @ (0x271 * 8 + 0)
#define                                 I2C1SCLPPS0_bit     _BIT_ACCESS(I2C1SCLPPS,0)
// I2C1SCLPPS<I2C1SCLPPS1>
extern volatile __bit                   I2C1SCLPPS1         __at(0x1389);	// @ (0x271 * 8 + 1)
#define                                 I2C1SCLPPS1_bit     _BIT_ACCESS(I2C1SCLPPS,1)
// I2C1SCLPPS<I2C1SCLPPS2>
extern volatile __bit                   I2C1SCLPPS2         __at(0x138A);	// @ (0x271 * 8 + 2)
#define                                 I2C1SCLPPS2_bit     _BIT_ACCESS(I2C1SCLPPS,2)
// I2C1SCLPPS<I2C1SCLPPS3>
extern volatile __bit                   I2C1SCLPPS3         __at(0x138B);	// @ (0x271 * 8 + 3)
#define                                 I2C1SCLPPS3_bit     _BIT_ACCESS(I2C1SCLPPS,3)
// I2C1SCLPPS<I2C1SCLPPS4>
extern volatile __bit                   I2C1SCLPPS4         __at(0x138C);	// @ (0x271 * 8 + 4)
#define                                 I2C1SCLPPS4_bit     _BIT_ACCESS(I2C1SCLPPS,4)
// I2C1SCLPPS<I2C1SCLPPS5>
extern volatile __bit                   I2C1SCLPPS5         __at(0x138D);	// @ (0x271 * 8 + 5)
#define                                 I2C1SCLPPS5_bit     _BIT_ACCESS(I2C1SCLPPS,5)
// I2C1SDAPPS<I2C1SDAPPS0>
extern volatile __bit                   I2C1SDAPPS0         __at(0x1380);	// @ (0x270 * 8 + 0)
#define                                 I2C1SDAPPS0_bit     _BIT_ACCESS(I2C1SDAPPS,0)
// I2C1SDAPPS<I2C1SDAPPS1>
extern volatile __bit                   I2C1SDAPPS1         __at(0x1381);	// @ (0x270 * 8 + 1)
#define                                 I2C1SDAPPS1_bit     _BIT_ACCESS(I2C1SDAPPS,1)
// I2C1SDAPPS<I2C1SDAPPS2>
extern volatile __bit                   I2C1SDAPPS2         __at(0x1382);	// @ (0x270 * 8 + 2)
#define                                 I2C1SDAPPS2_bit     _BIT_ACCESS(I2C1SDAPPS,2)
// I2C1SDAPPS<I2C1SDAPPS3>
extern volatile __bit                   I2C1SDAPPS3         __at(0x1383);	// @ (0x270 * 8 + 3)
#define                                 I2C1SDAPPS3_bit     _BIT_ACCESS(I2C1SDAPPS,3)
// I2C1SDAPPS<I2C1SDAPPS4>
extern volatile __bit                   I2C1SDAPPS4         __at(0x1384);	// @ (0x270 * 8 + 4)
#define                                 I2C1SDAPPS4_bit     _BIT_ACCESS(I2C1SDAPPS,4)
// I2C1SDAPPS<I2C1SDAPPS5>
extern volatile __bit                   I2C1SDAPPS5         __at(0x1385);	// @ (0x270 * 8 + 5)
#define                                 I2C1SDAPPS5_bit     _BIT_ACCESS(I2C1SDAPPS,5)
// PIE7<I2C1TXIE>
extern volatile __bit                   I2C1TXIE            __at(0x2571);	// @ (0x4AE * 8 + 1)
#define                                 I2C1TXIE_bit        _BIT_ACCESS(PIE7,1)
// PIR7<I2C1TXIF>
extern volatile __bit                   I2C1TXIF            __at(0x25C9);	// @ (0x4B9 * 8 + 1)
#define                                 I2C1TXIF_bit        _BIT_ACCESS(PIR7,1)
// IPR7<I2C1TXIP>
extern volatile __bit                   I2C1TXIP            __at(0x2519);	// @ (0x4A3 * 8 + 1)
#define                                 I2C1TXIP_bit        _BIT_ACCESS(IPR7,1)
// I2C1BTOC<I2CBTOC0>
extern volatile __bit                   I2CBTOC0            __at(0x14F8);	// @ (0x29F * 8 + 0)
#define                                 I2CBTOC0_bit        _BIT_ACCESS(I2C1BTOC,0)
// I2C1BTOC<I2CBTOC1>
extern volatile __bit                   I2CBTOC1            __at(0x14F9);	// @ (0x29F * 8 + 1)
#define                                 I2CBTOC1_bit        _BIT_ACCESS(I2C1BTOC,1)
// I2C1BTOC<I2CBTOC2>
extern volatile __bit                   I2CBTOC2            __at(0x14FA);	// @ (0x29F * 8 + 2)
#define                                 I2CBTOC2_bit        _BIT_ACCESS(I2C1BTOC,2)
// I2C1BTOC<I2CBTOC3>
extern volatile __bit                   I2CBTOC3            __at(0x14FB);	// @ (0x29F * 8 + 3)
#define                                 I2CBTOC3_bit        _BIT_ACCESS(I2C1BTOC,3)
// I2C1CLK<I2CCLK0>
extern volatile __bit                   I2CCLK0             __at(0x14F0);	// @ (0x29E * 8 + 0)
#define                                 I2CCLK0_bit         _BIT_ACCESS(I2C1CLK,0)
// I2C1CLK<I2CCLK1>
extern volatile __bit                   I2CCLK1             __at(0x14F1);	// @ (0x29E * 8 + 1)
#define                                 I2CCLK1_bit         _BIT_ACCESS(I2C1CLK,1)
// I2C1CLK<I2CCLK2>
extern volatile __bit                   I2CCLK2             __at(0x14F2);	// @ (0x29E * 8 + 2)
#define                                 I2CCLK2_bit         _BIT_ACCESS(I2C1CLK,2)
// I2C1CLK<I2CCLK3>
extern volatile __bit                   I2CCLK3             __at(0x14F3);	// @ (0x29E * 8 + 3)
#define                                 I2CCLK3_bit         _BIT_ACCESS(I2C1CLK,3)
// I2C1CLK<I2CCLK4>
extern volatile __bit                   I2CCLK4             __at(0x14F4);	// @ (0x29E * 8 + 4)
#define                                 I2CCLK4_bit         _BIT_ACCESS(I2C1CLK,4)
// I2C1CON0<I2CEN>
extern volatile __bit                   I2CEN               __at(0x149F);	// @ (0x293 * 8 + 7)
#define                                 I2CEN_bit           _BIT_ACCESS(I2C1CON0,7)
// ADCON0<IC>
extern volatile __bit                   IC                  __at(0x1F99);	// @ (0x3F3 * 8 + 1)
#define                                 IC_bit              _BIT_ACCESS(ADCON0,1)
// CPUDOZE<IDLEN>
extern volatile __bit                   IDLEN               __at(0x2797);	// @ (0x4F2 * 8 + 7)
#define                                 IDLEN_bit           _BIT_ACCESS(CPUDOZE,7)
// CWG1CON1<IN>
extern volatile __bit                   IN                  __at(0x1E0D);	// @ (0x3C1 * 8 + 5)
#define                                 IN_bit              _BIT_ACCESS(CWG1CON1,5)
// NCO1INCL<INC0>
extern volatile __bit                   INC0                __at(0x2218);	// @ (0x443 * 8 + 0)
#define                                 INC0_bit            _BIT_ACCESS(NCO1INCL,0)
// NCO1INCL<INC1>
extern volatile __bit                   INC1                __at(0x2219);	// @ (0x443 * 8 + 1)
#define                                 INC1_bit            _BIT_ACCESS(NCO1INCL,1)
// NCO1INCH<INC10>
extern volatile __bit                   INC10               __at(0x2222);	// @ (0x444 * 8 + 2)
#define                                 INC10_bit           _BIT_ACCESS(NCO1INCH,2)
// NCO1INCH<INC11>
extern volatile __bit                   INC11               __at(0x2223);	// @ (0x444 * 8 + 3)
#define                                 INC11_bit           _BIT_ACCESS(NCO1INCH,3)
// NCO1INCH<INC12>
extern volatile __bit                   INC12               __at(0x2224);	// @ (0x444 * 8 + 4)
#define                                 INC12_bit           _BIT_ACCESS(NCO1INCH,4)
// NCO1INCH<INC13>
extern volatile __bit                   INC13               __at(0x2225);	// @ (0x444 * 8 + 5)
#define                                 INC13_bit           _BIT_ACCESS(NCO1INCH,5)
// NCO1INCH<INC14>
extern volatile __bit                   INC14               __at(0x2226);	// @ (0x444 * 8 + 6)
#define                                 INC14_bit           _BIT_ACCESS(NCO1INCH,6)
// NCO1INCH<INC15>
extern volatile __bit                   INC15               __at(0x2227);	// @ (0x444 * 8 + 7)
#define                                 INC15_bit           _BIT_ACCESS(NCO1INCH,7)
// NCO1INCU<INC16>
extern volatile __bit                   INC16               __at(0x2228);	// @ (0x445 * 8 + 0)
#define                                 INC16_bit           _BIT_ACCESS(NCO1INCU,0)
// NCO1INCU<INC17>
extern volatile __bit                   INC17               __at(0x2229);	// @ (0x445 * 8 + 1)
#define                                 INC17_bit           _BIT_ACCESS(NCO1INCU,1)
// NCO1INCU<INC18>
extern volatile __bit                   INC18               __at(0x222A);	// @ (0x445 * 8 + 2)
#define                                 INC18_bit           _BIT_ACCESS(NCO1INCU,2)
// NCO1INCU<INC19>
extern volatile __bit                   INC19               __at(0x222B);	// @ (0x445 * 8 + 3)
#define                                 INC19_bit           _BIT_ACCESS(NCO1INCU,3)
// NCO1INCL<INC2>
extern volatile __bit                   INC2                __at(0x221A);	// @ (0x443 * 8 + 2)
#define                                 INC2_bit            _BIT_ACCESS(NCO1INCL,2)
// NCO1INCL<INC3>
extern volatile __bit                   INC3                __at(0x221B);	// @ (0x443 * 8 + 3)
#define                                 INC3_bit            _BIT_ACCESS(NCO1INCL,3)
// NCO1INCL<INC4>
extern volatile __bit                   INC4                __at(0x221C);	// @ (0x443 * 8 + 4)
#define                                 INC4_bit            _BIT_ACCESS(NCO1INCL,4)
// NCO1INCL<INC5>
extern volatile __bit                   INC5                __at(0x221D);	// @ (0x443 * 8 + 5)
#define                                 INC5_bit            _BIT_ACCESS(NCO1INCL,5)
// NCO1INCL<INC6>
extern volatile __bit                   INC6                __at(0x221E);	// @ (0x443 * 8 + 6)
#define                                 INC6_bit            _BIT_ACCESS(NCO1INCL,6)
// NCO1INCL<INC7>
extern volatile __bit                   INC7                __at(0x221F);	// @ (0x443 * 8 + 7)
#define                                 INC7_bit            _BIT_ACCESS(NCO1INCL,7)
// NCO1INCH<INC8>
extern volatile __bit                   INC8                __at(0x2220);	// @ (0x444 * 8 + 0)
#define                                 INC8_bit            _BIT_ACCESS(NCO1INCH,0)
// NCO1INCH<INC9>
extern volatile __bit                   INC9                __at(0x2221);	// @ (0x444 * 8 + 1)
#define                                 INC9_bit            _BIT_ACCESS(NCO1INCH,1)
// INLVLA<INLVLA0>
extern volatile __bit                   INLVLA0             __at(0x2020);	// @ (0x404 * 8 + 0)
#define                                 INLVLA0_bit         _BIT_ACCESS(INLVLA,0)
// INLVLA<INLVLA1>
extern volatile __bit                   INLVLA1             __at(0x2021);	// @ (0x404 * 8 + 1)
#define                                 INLVLA1_bit         _BIT_ACCESS(INLVLA,1)
// INLVLA<INLVLA2>
extern volatile __bit                   INLVLA2             __at(0x2022);	// @ (0x404 * 8 + 2)
#define                                 INLVLA2_bit         _BIT_ACCESS(INLVLA,2)
// INLVLA<INLVLA3>
extern volatile __bit                   INLVLA3             __at(0x2023);	// @ (0x404 * 8 + 3)
#define                                 INLVLA3_bit         _BIT_ACCESS(INLVLA,3)
// INLVLA<INLVLA4>
extern volatile __bit                   INLVLA4             __at(0x2024);	// @ (0x404 * 8 + 4)
#define                                 INLVLA4_bit         _BIT_ACCESS(INLVLA,4)
// INLVLA<INLVLA5>
extern volatile __bit                   INLVLA5             __at(0x2025);	// @ (0x404 * 8 + 5)
#define                                 INLVLA5_bit         _BIT_ACCESS(INLVLA,5)
// INLVLA<INLVLA6>
extern volatile __bit                   INLVLA6             __at(0x2026);	// @ (0x404 * 8 + 6)
#define                                 INLVLA6_bit         _BIT_ACCESS(INLVLA,6)
// INLVLA<INLVLA7>
extern volatile __bit                   INLVLA7             __at(0x2027);	// @ (0x404 * 8 + 7)
#define                                 INLVLA7_bit         _BIT_ACCESS(INLVLA,7)
// INLVLB<INLVLB0>
extern volatile __bit                   INLVLB0             __at(0x2060);	// @ (0x40C * 8 + 0)
#define                                 INLVLB0_bit         _BIT_ACCESS(INLVLB,0)
// INLVLB<INLVLB1>
extern volatile __bit                   INLVLB1             __at(0x2061);	// @ (0x40C * 8 + 1)
#define                                 INLVLB1_bit         _BIT_ACCESS(INLVLB,1)
// INLVLB<INLVLB2>
extern volatile __bit                   INLVLB2             __at(0x2062);	// @ (0x40C * 8 + 2)
#define                                 INLVLB2_bit         _BIT_ACCESS(INLVLB,2)
// INLVLB<INLVLB3>
extern volatile __bit                   INLVLB3             __at(0x2063);	// @ (0x40C * 8 + 3)
#define                                 INLVLB3_bit         _BIT_ACCESS(INLVLB,3)
// INLVLB<INLVLB4>
extern volatile __bit                   INLVLB4             __at(0x2064);	// @ (0x40C * 8 + 4)
#define                                 INLVLB4_bit         _BIT_ACCESS(INLVLB,4)
// INLVLB<INLVLB5>
extern volatile __bit                   INLVLB5             __at(0x2065);	// @ (0x40C * 8 + 5)
#define                                 INLVLB5_bit         _BIT_ACCESS(INLVLB,5)
// INLVLB<INLVLB6>
extern volatile __bit                   INLVLB6             __at(0x2066);	// @ (0x40C * 8 + 6)
#define                                 INLVLB6_bit         _BIT_ACCESS(INLVLB,6)
// INLVLB<INLVLB7>
extern volatile __bit                   INLVLB7             __at(0x2067);	// @ (0x40C * 8 + 7)
#define                                 INLVLB7_bit         _BIT_ACCESS(INLVLB,7)
// INLVLC<INLVLC0>
extern volatile __bit                   INLVLC0             __at(0x20A0);	// @ (0x414 * 8 + 0)
#define                                 INLVLC0_bit         _BIT_ACCESS(INLVLC,0)
// INLVLC<INLVLC1>
extern volatile __bit                   INLVLC1             __at(0x20A1);	// @ (0x414 * 8 + 1)
#define                                 INLVLC1_bit         _BIT_ACCESS(INLVLC,1)
// INLVLC<INLVLC2>
extern volatile __bit                   INLVLC2             __at(0x20A2);	// @ (0x414 * 8 + 2)
#define                                 INLVLC2_bit         _BIT_ACCESS(INLVLC,2)
// INLVLC<INLVLC3>
extern volatile __bit                   INLVLC3             __at(0x20A3);	// @ (0x414 * 8 + 3)
#define                                 INLVLC3_bit         _BIT_ACCESS(INLVLC,3)
// INLVLC<INLVLC4>
extern volatile __bit                   INLVLC4             __at(0x20A4);	// @ (0x414 * 8 + 4)
#define                                 INLVLC4_bit         _BIT_ACCESS(INLVLC,4)
// INLVLC<INLVLC5>
extern volatile __bit                   INLVLC5             __at(0x20A5);	// @ (0x414 * 8 + 5)
#define                                 INLVLC5_bit         _BIT_ACCESS(INLVLC,5)
// INLVLC<INLVLC6>
extern volatile __bit                   INLVLC6             __at(0x20A6);	// @ (0x414 * 8 + 6)
#define                                 INLVLC6_bit         _BIT_ACCESS(INLVLC,6)
// INLVLC<INLVLC7>
extern volatile __bit                   INLVLC7             __at(0x20A7);	// @ (0x414 * 8 + 7)
#define                                 INLVLC7_bit         _BIT_ACCESS(INLVLC,7)
// INLVLE<INLVLE3>
extern volatile __bit                   INLVLE3             __at(0x2123);	// @ (0x424 * 8 + 3)
#define                                 INLVLE3_bit         _BIT_ACCESS(INLVLE,3)
// INTCON0<INT0EDG>
extern volatile __bit                   INT0EDG             __at(0x26B0);	// @ (0x4D6 * 8 + 0)
#define                                 INT0EDG_bit         _BIT_ACCESS(INTCON0,0)
// PIE1<INT0IE>
extern volatile __bit                   INT0IE              __at(0x2540);	// @ (0x4A8 * 8 + 0)
#define                                 INT0IE_bit          _BIT_ACCESS(PIE1,0)
// PIR1<INT0IF>
extern volatile __bit                   INT0IF              __at(0x2598);	// @ (0x4B3 * 8 + 0)
#define                                 INT0IF_bit          _BIT_ACCESS(PIR1,0)
// IPR1<INT0IP>
extern volatile __bit                   INT0IP              __at(0x24E8);	// @ (0x49D * 8 + 0)
#define                                 INT0IP_bit          _BIT_ACCESS(IPR1,0)
// INT0PPS<INT0PPS0>
extern volatile __bit                   INT0PPS0            __at(0x11F0);	// @ (0x23E * 8 + 0)
#define                                 INT0PPS0_bit        _BIT_ACCESS(INT0PPS,0)
// INT0PPS<INT0PPS1>
extern volatile __bit                   INT0PPS1            __at(0x11F1);	// @ (0x23E * 8 + 1)
#define                                 INT0PPS1_bit        _BIT_ACCESS(INT0PPS,1)
// INT0PPS<INT0PPS2>
extern volatile __bit                   INT0PPS2            __at(0x11F2);	// @ (0x23E * 8 + 2)
#define                                 INT0PPS2_bit        _BIT_ACCESS(INT0PPS,2)
// INT0PPS<INT0PPS3>
extern volatile __bit                   INT0PPS3            __at(0x11F3);	// @ (0x23E * 8 + 3)
#define                                 INT0PPS3_bit        _BIT_ACCESS(INT0PPS,3)
// INT0PPS<INT0PPS4>
extern volatile __bit                   INT0PPS4            __at(0x11F4);	// @ (0x23E * 8 + 4)
#define                                 INT0PPS4_bit        _BIT_ACCESS(INT0PPS,4)
// INT0PPS<INT0PPS5>
extern volatile __bit                   INT0PPS5            __at(0x11F5);	// @ (0x23E * 8 + 5)
#define                                 INT0PPS5_bit        _BIT_ACCESS(INT0PPS,5)
// INTCON0<INT1EDG>
extern volatile __bit                   INT1EDG             __at(0x26B1);	// @ (0x4D6 * 8 + 1)
#define                                 INT1EDG_bit         _BIT_ACCESS(INTCON0,1)
// PIE6<INT1IE>
extern volatile __bit                   INT1IE              __at(0x2568);	// @ (0x4AD * 8 + 0)
#define                                 INT1IE_bit          _BIT_ACCESS(PIE6,0)
// PIR6<INT1IF>
extern volatile __bit                   INT1IF              __at(0x25C0);	// @ (0x4B8 * 8 + 0)
#define                                 INT1IF_bit          _BIT_ACCESS(PIR6,0)
// IPR6<INT1IP>
extern volatile __bit                   INT1IP              __at(0x2510);	// @ (0x4A2 * 8 + 0)
#define                                 INT1IP_bit          _BIT_ACCESS(IPR6,0)
// INT1PPS<INT1PPS0>
extern volatile __bit                   INT1PPS0            __at(0x11F8);	// @ (0x23F * 8 + 0)
#define                                 INT1PPS0_bit        _BIT_ACCESS(INT1PPS,0)
// INT1PPS<INT1PPS1>
extern volatile __bit                   INT1PPS1            __at(0x11F9);	// @ (0x23F * 8 + 1)
#define                                 INT1PPS1_bit        _BIT_ACCESS(INT1PPS,1)
// INT1PPS<INT1PPS2>
extern volatile __bit                   INT1PPS2            __at(0x11FA);	// @ (0x23F * 8 + 2)
#define                                 INT1PPS2_bit        _BIT_ACCESS(INT1PPS,2)
// INT1PPS<INT1PPS3>
extern volatile __bit                   INT1PPS3            __at(0x11FB);	// @ (0x23F * 8 + 3)
#define                                 INT1PPS3_bit        _BIT_ACCESS(INT1PPS,3)
// INT1PPS<INT1PPS4>
extern volatile __bit                   INT1PPS4            __at(0x11FC);	// @ (0x23F * 8 + 4)
#define                                 INT1PPS4_bit        _BIT_ACCESS(INT1PPS,4)
// INT1PPS<INT1PPS5>
extern volatile __bit                   INT1PPS5            __at(0x11FD);	// @ (0x23F * 8 + 5)
#define                                 INT1PPS5_bit        _BIT_ACCESS(INT1PPS,5)
// INTCON0<INT2EDG>
extern volatile __bit                   INT2EDG             __at(0x26B2);	// @ (0x4D6 * 8 + 2)
#define                                 INT2EDG_bit         _BIT_ACCESS(INTCON0,2)
// PIE10<INT2IE>
extern volatile __bit                   INT2IE              __at(0x2588);	// @ (0x4B1 * 8 + 0)
#define                                 INT2IE_bit          _BIT_ACCESS(PIE10,0)
// PIR10<INT2IF>
extern volatile __bit                   INT2IF              __at(0x25E0);	// @ (0x4BC * 8 + 0)
#define                                 INT2IF_bit          _BIT_ACCESS(PIR10,0)
// IPR10<INT2IP>
extern volatile __bit                   INT2IP              __at(0x2530);	// @ (0x4A6 * 8 + 0)
#define                                 INT2IP_bit          _BIT_ACCESS(IPR10,0)
// INT2PPS<INT2PPS0>
extern volatile __bit                   INT2PPS0            __at(0x1200);	// @ (0x240 * 8 + 0)
#define                                 INT2PPS0_bit        _BIT_ACCESS(INT2PPS,0)
// INT2PPS<INT2PPS1>
extern volatile __bit                   INT2PPS1            __at(0x1201);	// @ (0x240 * 8 + 1)
#define                                 INT2PPS1_bit        _BIT_ACCESS(INT2PPS,1)
// INT2PPS<INT2PPS2>
extern volatile __bit                   INT2PPS2            __at(0x1202);	// @ (0x240 * 8 + 2)
#define                                 INT2PPS2_bit        _BIT_ACCESS(INT2PPS,2)
// INT2PPS<INT2PPS3>
extern volatile __bit                   INT2PPS3            __at(0x1203);	// @ (0x240 * 8 + 3)
#define                                 INT2PPS3_bit        _BIT_ACCESS(INT2PPS,3)
// INT2PPS<INT2PPS4>
extern volatile __bit                   INT2PPS4            __at(0x1204);	// @ (0x240 * 8 + 4)
#define                                 INT2PPS4_bit        _BIT_ACCESS(INT2PPS,4)
// INT2PPS<INT2PPS5>
extern volatile __bit                   INT2PPS5            __at(0x1205);	// @ (0x240 * 8 + 5)
#define                                 INT2PPS5_bit        _BIT_ACCESS(INT2PPS,5)
// HLVDCON0<INTH>
extern volatile __bit                   INTH                __at(0x251);	// @ (0x4A * 8 + 1)
#define                                 INTH_bit            _BIT_ACCESS(HLVDCON0,1)
// HLVDCON0<INTL>
extern volatile __bit                   INTL                __at(0x250);	// @ (0x4A * 8 + 0)
#define                                 INTL_bit            _BIT_ACCESS(HLVDCON0,0)
// IOCAF<IOCAF0>
extern volatile __bit                   IOCAF0              __at(0x2038);	// @ (0x407 * 8 + 0)
#define                                 IOCAF0_bit          _BIT_ACCESS(IOCAF,0)
// IOCAF<IOCAF1>
extern volatile __bit                   IOCAF1              __at(0x2039);	// @ (0x407 * 8 + 1)
#define                                 IOCAF1_bit          _BIT_ACCESS(IOCAF,1)
// IOCAF<IOCAF2>
extern volatile __bit                   IOCAF2              __at(0x203A);	// @ (0x407 * 8 + 2)
#define                                 IOCAF2_bit          _BIT_ACCESS(IOCAF,2)
// IOCAF<IOCAF3>
extern volatile __bit                   IOCAF3              __at(0x203B);	// @ (0x407 * 8 + 3)
#define                                 IOCAF3_bit          _BIT_ACCESS(IOCAF,3)
// IOCAF<IOCAF4>
extern volatile __bit                   IOCAF4              __at(0x203C);	// @ (0x407 * 8 + 4)
#define                                 IOCAF4_bit          _BIT_ACCESS(IOCAF,4)
// IOCAF<IOCAF5>
extern volatile __bit                   IOCAF5              __at(0x203D);	// @ (0x407 * 8 + 5)
#define                                 IOCAF5_bit          _BIT_ACCESS(IOCAF,5)
// IOCAF<IOCAF6>
extern volatile __bit                   IOCAF6              __at(0x203E);	// @ (0x407 * 8 + 6)
#define                                 IOCAF6_bit          _BIT_ACCESS(IOCAF,6)
// IOCAF<IOCAF7>
extern volatile __bit                   IOCAF7              __at(0x203F);	// @ (0x407 * 8 + 7)
#define                                 IOCAF7_bit          _BIT_ACCESS(IOCAF,7)
// IOCAN<IOCAN0>
extern volatile __bit                   IOCAN0              __at(0x2030);	// @ (0x406 * 8 + 0)
#define                                 IOCAN0_bit          _BIT_ACCESS(IOCAN,0)
// IOCAN<IOCAN1>
extern volatile __bit                   IOCAN1              __at(0x2031);	// @ (0x406 * 8 + 1)
#define                                 IOCAN1_bit          _BIT_ACCESS(IOCAN,1)
// IOCAN<IOCAN2>
